{"url": "jis.gov.jm/president-trump-underscores-us-jamaica-relations/", "text": "United States President, Donald Trump, says he looks forward to working with the administration of Prime Minister, the Most Hon. Andrew Holness, on bilateral and regional issues.\n\nThe President made the comment during a courtesy call paid on him by Jamaica’s Ambassador to the United States, Her Excellency Audrey Marks, at the Oval Office in the White House.\n\nDuring their discourse, Mr Trump and Ambassador Marks underscored the strong longstanding bond of friendship between the people Jamaica and the United States of America, while noting the island’s contribution in many spheres of American life.\n\nMs Marks said she looked forward to working with the President in the interest of both countries, and highlighted the synergies of the US-Caribbean nexus cementing the relationship between the nations.\n\nThe Ambassador, in noting the President’s agenda of providing more trading opportunities for US companies, called attention to the significant trade surplus the North American country enjoys in the Caribbean.\n\nShe highlighted the fact that the region is the United States’ seventh largest trading partner, importing non-oil goods and services valued over US$50 billion.\n\nThis, she said, placed the region ahead of U.S. exports to comparatively larger economies such as Russia and India combined.\n\nMs Marks further noted the mutual benefit and alignment of interest for the continued stability and economic growth of the Caribbean which she described as the United States’ ‘third border’.\n\nThe Jamaican envoy also took the opportunity to invite President Trump to visit Jamaica in his official capacity.", "images": ["https://jis.gov.jm/media/IMG_0930-1.jpg", "https://jis.gov.jm/media/2025/03/Bulletin-MARCH-24-2025-278x500.jpg", "https://jis.gov.jm/media/favicon.png", "https://jis.gov.jm/media/2025/04/JIS-Bulletin-Gleaner-24.04.25-print-280x500.jpg", "https://jis.gov.jm/media/2025/05/Observer-Wednesday-April-30-2025--371x500.jpg", "https://jis.gov.jm/media/2025/05/Observer-Wednesday-May-28-2025--367x500.jpg", "https://jis.gov.jm/media/2018/10/jis-logo-icon-color.png", "http://jis.gov.jm/media/2023/06/iso-9001-2015-certification-500x201.png", "https://jis.gov.jm/media/2024/08/x-social-media-white-icon.png", "http://jis.gov.jm/wp-content/themes/jis2022/img/ja-flag.jpg"], "top_img": "https://jis.gov.jm/media/favicon.png", "keywords": [], "authors": ["Derrick Scott"], "canonical_link": "https://jis.gov.jm/president-trump-underscores-us-jamaica-relations/", "title": "President Trump Underscores US-Jamaica Relations – Jamaica Information Service", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "mobile-web-app-capable": "yes", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Jamaica Information Service - The Voice of Jamaica", "robots": "max-image-preview:large", "dlm-version": "5.0.29", "generator": "Powered by Slider Revolution 6.7.17 - responsive, Mobile-Friendly Slider Plugin for WordPress with comfortable drag and drop interface.", "tec-api-version": "v1", "tec-api-origin": "https://jis.gov.jm", "msapplication-TileImage": "https://jis.gov.jm/media/cropped-favicon-500x500.png"}, "movies": [], "publish_date": null, "source": "http://jis.gov.jm", "summary": ""}