{"url": "www.mirror.co.uk/news/us-news/there-blood-everywhere-terrified-students-12029466", "text": "Inside the Snapchat bloodbath: 60 minutes of terror which left 17 dead, bodies in classrooms and kids 'full of blood'\n\nWARNING - DISTRESSING CONTENT: Horrifying video captured during a mass shooting at Marjory Stoneman Douglas High School in Parkland, Florida, shows lifeless victims on the floor\n\nTerrified teens ran past dead bodies and screamed in horror as they fled a Florida high school where a 'crazed' gunman killed 17 people in the latest US mass shooting.\n\n‌\n\n\n\nHorrifying video captured by a student shows lifeless victims as teens were rescued by police and ushered out of Marjory Stoneman Douglas High School in Parkland.\n\n‌\n\n\n\nStudents and staff barricaded themselves inside classrooms - with one group hiding in a closet as pupils cried in terror - as the shooter carried out the Valentine's Day massacre with an assault rifle despite previous warning signs.\n\n‌\n\n\n\nIn the aftermath, one traumatised survivor described how \"there was blood everywhere\" after bullets were fired through classroom windows as the gunman stalked the sprawling campus.\n\nTeens posted disturbing photos and videos on social media, with one showing students hiding under desks and screaming as barrage of gunshots echo through the building.\n\nThe suspected gunman, Nikolas Cruz, was charged on Thursday with 17 counts of premeditated murder, with the victims including an assistant football coach who gave his life to protect students.\n\n‌\n\n\n\nA police officer checks on one of the victims in a classroom (Image: Liveleak) A student runs past a body in a classroom (Image: Liveleak)\n\nPupils run out of the school after police entered the building (Image: Liveleak)\n\n‌\n\n\n\nToday he appeared in court for the first time since the atrocity in Florida and will be remanded in custody.\n\nDressed in orange overalls, he bowed his head as the charge was read out to him.\n\nA judge told him: \"I have something very important to tell you. You are charged with some very serious crimes.\"\n\n‌\n\n\n\nHe was told he would be \"held without bond until further order\".\n\nHis lawyer Melissa McNeill said today after the hearing: \"He's a broken human being, he's a broken child.\n\n\"The sadness this community is feeling, I mean my children go to school in this community. I feel horrible for these families.\n\n‌\n\n\n\n\"And Mr Cruz feels that pain.\"\n\nAll 17 families have been notified of the loss of their loved ones, police said in a briefing today.\n\nThe victims included students Jaime Guttenburg, Alaina Petty, 14, Martin Duque,14, Alyssa Al Hadeff, 15, Gina Montalto, 14, and Nick Dworet, 18.\n\n‌\n\n\n\nLuke Hoyer, Carmen Schentrup, Meadow Pollack, 18, Joaquin Oliver, 17, Cara Loughran, Peter Wang, 15, and Alex Schachter were also killed.\n\nAaron Feis, 37, staff member Chris Hixon, 49, and science teacher Scott Beigel also were among the victims.\n\n‌\n\n\n\nThe moment suspect Nikolas Cruz, 19, was arrested by police (Image: Twitter/@JoshCohenRadio)\n\nCruz was surrounded by police outside a hospital where he was taken (Image: WPLG)\n\nCruz's former classmates claim he was a \"troubled\" loner obsessed with guns (Image: Nikolas_cruz/Instagram)\n\n‌\n\n\n\nCruz was charged with 17 counts of premeditated murder (Image: Broward County Sheriff)\n\nContent cannot be displayed without consent\n\n‌\n\n\n\nThe FBI has now launched an \"extensive review\" into how the 2017 tip into Nikolas Cruz was handled.\n\nIt has also emerged that Cruz particpated in activities of white nationalist militia.\n\n‌\n\n\n\nIn a press briefing today, Broward County Sheriff said sadly there were copycat threats made at other schools today and they would be taking all of these seriously and would respond in full.\n\nOfficials in a press briefing today also revealed there were still bodies in the school.\n\nChief Scott Israel said today: \"There are some bodies that are still in the school.\"\n\n‌\n\n\n\nHe said that \"today is the day of mourning\" after many lives were lost in the horrific incident.\n\nOn the investigation he said: \"We are not going to leave any stone unturned.\n\n\"We will interview every single student or person in that school who may know something.\n\n‌\n\n\n\n\"Law enforcement will do everything we can to make sure this person is convicted of all charges. We will make sure justice is served.\"\n\nMr Israel later added: \"What about the rights of people who go to school with book bags - don't they have the right to be protected?\"\n\nHe also called people in the community \"our eyes and ears\" and said \"right now, if you know anybody, this raises a red flag, don't just think about calling us, call us.\n\n‌\n\n\n\n\"If there's something in your gut that tells you there's something not right with this person, please say something.\"\n\nIn the press briefing today, Governor Rick Scott said: \"We need to make sure this never happens again.\"\n\nHe said: \"If somebody is mentally ill, they should not have access to a gun.\"\n\n‌\n\n\n\nSeventeen students and adults were killed and more than a dozen others were hospitalised in Wednesday afternoon's atrocity allegedly carried out by former student Cruz, described by ex-classmates as a \"troubled\" and depressed loner who was \"crazy about guns\" and had talked about shooting pupils.\n\nStudents had predicted Cruz would become a school shooter due to previous threats, his obsession with guns and knives and his unusual behaviour, it was claimed.\n\nPolice said the 19-year-old had previously been expelled from the school for disciplinary reasons, and returned with an AR-15 rifle - the same type of firearm used in many other massacres - plus a significant amount of ammunition and smoke bombs.\n\n‌\n\n\n\nThe gun was legally purchased, it was claimed as the motive for the attack - the ninth-deadliest mass shooting in modern US history - remained a mystery.\n\nThe atrocity began at about 2.30pm, with police claiming Cruz pulled the fire alarm and shot victims as they left classrooms before he blended in with pupils - pretending to be one of the terrified teens - and left the campus within about 25 minutes.\n\n‌\n\n\n\nA body on the floor of a classroom where students were rescued by police (Image: Liveleak) A photo from an Instagram account belonging to the suspected gunman (Image: Nikolas_cruz/Instagram)\n\nA school yearbook photo of Cruz (Image: Unknown)\n\n‌\n\n\n\n'Nikolas Cruz posts disturbing Instagram posts' ,ahead of mass shooting\n\n‌\n\n\n\nIn the video showing terrified students fleeing after shots had already been fired, pupils scream and cry in a classroom where police crouch over a body on the floor.\n\n‌\n\n\n\nAn injured girl is carried out of the room by police and her classmates follow behind her and the officers after someone says \"let's go, come on\".\n\nThere are loud screams as students - including an injured boy grimacing and clutching his shoulder - pass bodies in a corridor and they are urged to \"run\" to safety.\n\n‌\n\n\n\n‌\n\n\n\nStudent Geovanni Vilsant, 15, told the Miami Herald that he heard gunfire when he was in a Spanish classroom and then saw three bodies on the floor as he fled the school.\n\nHe added: “There was blood everywhere. They weren't moving.\"\n\n‌\n\n\n\nStudents embrace after they were released from a lockdown at the school (Image: REX/Shutterstock)\n\nParents and their children had emotional reunions following the massacre (Image: Splash News)\n\n‌\n\n\n\nPeople are led out of Marjory Stoneman Douglas High School (Image: Getty Images North America)\n\nAn injured victim is carried by medical personnel (Image: REX/Shutterstock)\n\nArmed police in combat gear gather near the scene (Image: REX/Shutterstock)\n\n‌\n\n\n\nFirst victims of Florida school shooting identified including athletics coach and hero who tried to protect children READ MORE:\n\nA female student told Fox News of the distressing things she saw as police escorted her out.\n\nShe said: \"The police came through the hallway to get us and in the hallway, I saw a big pile of blood, like, kind of smeared as if they were dragged away, and I saw two girls probably dead in the hallway.\n\n\"And then, coming down the stairs, there was some more blood and outside the building there was another guy – I think it was a teacher – who was, [I’m] pretty sure was dead.\"\n\n‌\n\n\n\nStudent Rebecca Bogart, who was in Holocaust class, told the newspaper that bullets shattered a classroom window and teens ducked for cover.\n\n‌\n\n\n\n‌\n\n\n\nOne of the gunman's victims is taken to an ambulance (Image: REX/Shutterstock)\n\nMedical personnel tend to one of the victims outside the school (Image: REX/Shutterstock)\n\n‌\n\n\n\nRebecca, 17, said she got onto the floor and hid under a teacher's desk.\n\nShe added: “Four kids in my class were hurt. There was blood everywhere. I’m so glad to be living right now.\n\n‌\n\n\n\n\"I knew what gunshots sounded like, but not that loud or extreme. It smelled smoky.”\n\nSarah Crescitelli hid in a theatre class bathroom and sent a text message to her parents reading: “If I don’t make it I love you and I appreciated everything you did for me.”\n\n‌\n\n\n\nA mother hugs her daughter after she made it out alive (Image: REX/Shutterstock)\n\nDistraught people wait for updates near the high school (Image: REX/Shutterstock)\n\nCruz allegedly wore a gas mask and tossed smoke bombs into a corridor before pulling the fire alarm and shooting people as they ran through the haze.\n\n‌\n\n\n\nThere was confusion when the alarm went off, as students and staff had practiced a drill earlier in the day.\n\nThe gunman went through corridors all over the campus, shooting more victims before leaving and blending in with pupils as they fled, it was claimed.\n\nThe local school superintendent said it's believed Cruz took an Uber car to the campus.\n\n‌\n\n\n\nCruz was allegedly carrying the gun in a duffel bag and had brought extra clothing with him, it was reported.\n\nStudents leave the school in Parkland, Florida (Image: REUTERS)\n\nStudent Matthew Walker, 17, told ABC 17 that the suspect was known to show off guns and knives.\n\n‌\n\n\n\nThe student said: \"He was going class to class just shooting at random kids. Everything he posts (on social media) is about weapons. It's sick.\"\n\nAnother student, Eddie Bonilla, told CBS Miami that other students \"knew it was going to be him\"\n\nThe student said: \"A lot of people were saying it was going to be him.\n\n‌\n\n\n\n\"A lot of kids threw jokes around saying that he was going to be the one to shoot up the school.\n\n\"It turns out that everyone predicted it. That's crazy.\"\n\n‌\n\n\n\n‌\n\n\n\nHeavily-armed police officers surrounded the school (Image: REX/Shutterstock)\n\nRescue workers rushed several victims to hospital (Image: REUTERS)\n\n‌\n\n\n\nFootage of a person being taken into custody following Florida school shooting\n\nThe rampage began shortly before lessons were due to end for the day at the school in Broward County, about 45 miles north of Miami. Tales of heroism began to emerge in the hours that followed.\n\nSchool football coach and security guard Aaron Feis, 37, was fatally injured when he threw himself in front of pupils to shield them from the killer's bullets.\n\n‌\n\n\n\nThe football team confirmed his death on Thursday, writing on Twitter: \"It is with Great sadness that our Football Family has learned about the death of Aaron Feis.\n\n\"He was our Assistant Football Coach and security guard. He selflessly shielded students from the shooter when he was shot.\n\n\"He died a hero and he will forever be in our hearts and memories.\"\n\n‌\n\n\n\nSchool football coach Aaron Feis is said to have thrown himself in front of pupils (Image: Facebook)\n\nMr Feis was hailed a hero for giving his life to protect students (Image: Facebook)\n\nLanguage arts teacher Melissa Falkowski hid 19 of her students in a classroom closet as the gunman went through the school.\n\n‌\n\n\n\nShe climbed in after them and they hid from the suspect until it was safe to come out.\n\nIn the aftermath, Ms Falkowski hit out at the US government and society for failing to prevent the massacre.\n\nShe told CNN: \"This is the worst nightmare that could ever happen to you.\"\n\n‌\n\n\n\nShe added: \"We’ve trained the kids what to do, and the frustration is that we did everything that we were supposed to do... and still have to have so many casualties.\"\n\n‌\n\n\n\nLanguage arts teacher Melissa Falkowski hid 19 students in a closet (Image: Facebook)\n\n‌\n\n\n\nJaime Guttenberg was a student at the high school in Parkland (Image: Facebook)\n\nProfiles of the victims, including Mr Feis, were also starting to emerge on Thursday, as students from nearby schools returned to lessons under increased security.\n\nStudent Jaime Guttenberg, 17, was confirmed dead after her parents, Fred and Jennifer, were unable to contact her amid the chaos and launched a desperate bid to find her.\n\n‌\n\n\n\nMr Guttenberg posted on Facebok saying his son Jesse had escaped unharmed but added: \"We cannot reach Jaime.\n\n\"If anyone has a child who saw or spoke to Jaime please call me.\"\n\nThe parents were later given the heartbreaking news that their daughter was among the dead.\n\n‌\n\n\n\nHer cousin Marc Pollack posted a tribute on Facebook, writing: \"This is a picture of our sweet cousin Jaime who was senselessly and tragically killed today at Stoneman Douglas High School.\n\n\"My heart is broken from the loss of this awesome young girl and the pain that our entire family is enduring.\"\n\nJaime's parents had launched a desperate bid to find her (Image: Facebook)\n\n‌\n\n\n\nA cousin remembered Jaime as an \"awesome young girl\" (Image: Facebook)\n\nTerrified students ran out of the building, while others took refuge inside as bursts of gunfire rang out. Staff and students got on the floor in locked classrooms, with reports that the gunman shot through windows or doors.\n\n‌\n\n\n\nHannah Siren, 14, who was in maths class, told the Orlando Sentinel: \"The people next door to us must have not locked their door.They all got shot.\"\n\nStudent Alexa Miednik said she briefly spoke to Cruz as she and others rushed outside after the fire alarm went off and gunshots were heard.\n\nShe said: \"As we were walking the whole class together, I actually was speaking to the suspect Nikolas Cruz, and as I was speaking to him he seemed very, I don’t know what the word I want to say is, but he was troubled in middle school.\n\n‌\n\n\n\n\"So, I kind of joked to him about it and said I’m surprised you weren’t the one who did it, and he just gave me a 'huh?'\"\n\n‌\n\n\n\nAs the lockdown was lifted after the rampage, bewildered students and staff streamed out of the school with their hands in the air, passing heavily-armed and helmeted police officers wearing combat gear.\n\n‌\n\n\n\nTwelve of the dead were killed inside the school, while two others were shot just outside. One more was gunned down on the street, and two other victims died in hospital.\n\nThe school, which has about 3,200 students, remained on lockdown for about 90 minutes before students were finally released and reunited with their distraught parents - who were anxiously waiting for updates - in emotional scenes.\n\n‌\n\n\n\nCruz - described by former classmates as a \"troubled\" loner who was obsessed with guns - was arrested just after 4pm by police in nearby Coral Springs. He was wearing wine-colored Reserve Officers' Training Corps polo shirt, black pants and black boots.\n\nPolice said Cruz, who worked at a local discount store and was attending a new school, was armed with an AR-15 rifle and had multiple magazines of ammunition when he was arrested without a struggle.\n\n‌\n\n\n\nStudents were brought out of the school single file (Image: Getty Images North America)\n\nPolice wearing combat gear responded to the mass shooting (Image: REX/Shutterstock)\n\nBrent Black, a former classmate, told ABC News that Cruz had previously threatened to go on a shooting spree at the school.\n\n‌\n\n\n\nHe said: \"About a year ago I saw him upset in the morning. And I was like, 'yo what’s wrong with you?'\n\n\"And he was like 'umm, don’t know.' And I was like 'what’s up with you?'\n\n\"He's like, 'I swear to God I'll shoot up this school'. And then I was like, 'watch what you’re saying around me', and then I just left him after that. He came up to me later on the day and apologised for what he said.\"\n\n‌\n\n\n\nStudents told reporters that Cruz was familiar with the school's layout and had been involved in fire drills in the past, so he knew what to expect when the alarm went off.\n\nStudents gather outside the school after being released from a lockdown (Image: REX/Shutterstock)\n\nParents were desperate for updates before their children were released (Image: Getty Images North America)\n\n‌\n\n\n\nAttorney Jim Lewis told the South Florida Sun Sentinel that the AR-15 used in the mass shooting was legally bought by Cruz, who lived with a family friend following his mum Lynda 's death.\n\n‌\n\n\n\nA source told CNN that Cruz had purchased the gun in the past year after passing a background check.\n\n‌\n\n\n\nCruz's adoptive mum died in November at age 68 from pneumonia, while his dad Roger died from a heart attack when he was a younger boy, it was reported.\n\nThe couple had reportedly adopted Cruz on the day he was born, along with his biological brother, Zachary.\n\n‌\n\n\n\nSpeaking on behalf of the family friend, Lewis said: “It was his gun. The family made him keep it in a locked gun cabinet in the house but he had a key.”\n\n‌\n\n\n\nLewis said the family let Cruz move in around Thanksgiving, gave him a room and urged him to attend adult education classes.\n\nParents hug as they wait for updates from authorities (Image: REX/Shutterstock)\n\nThe lawyer said Cruz was \"depressed\" following his mum's death, and the family who took him in \"didn’t see this coming\".\n\n‌\n\n\n\nA relative told US media that Cruz had been diagnosed with autism.\n\nFollowing his arrest, Cruz was questioned for hours by detectives before he was charged with 17 counts of premeditated murder. Officers searched a number of properties linked to the suspect, including the home where he was living with a family friend.\n\nThe FBI and Department of Homeland Security were assisting with the investigation.\n\n‌\n\n\n\nFormer classmates claim he had previously threatened to shoot up the school, he had talked about shooting animals and he was obsessed with guns.\n\nThey also said he had a bad school record and was expelled from Douglas High School after getting into a fight with his ex-girlfriend's new boyfriend.\n\nBroward County School District Superintendent Robert Runcie told reporters he did not know of any threats posed by Cruz to the school.\n\n‌\n\n\n\nPolice and fire rescue vehicles parked near the scene (Image: AFP)\n\nBut maths teacher Jim Gard told the Miami Herald that he believes the school had sent out an email warning teachers that Cruz should not be allowed on campus with a backpack.\n\nHe added: \"There were problems with him last year threatening students, and I guess he was asked to leave campus.\"\n\n‌\n\n\n\n‌\n\n\n\nPhotos posted on Cruz's Instagram account showed him posing with guns and knives. Police have described the social media posts as “very, very disturbing\".\n\nIt also emerged that a YouTube user called 'Nikolas Cruz' had written chilling comments on videos just months ago.\n\nOne comment under a documentary about the 1966 Texas University massacre read \"I am going to what he did\" [sic].\n\n‌\n\n\n\nA YouTube comment by a user named 'Nikolas Cruz' (Image: YouTube)\n\nAnother YouTube user claims someone with the handle 'Nikolas Cruz' commented on one of his videos last year, writing: \"I want to be a professional school shooter.\"\n\nThe FBI were alerted to that post in September and carried out an investigation, but it was unclear what, if anything, happened from there.\n\n‌\n\n\n\n‌\n\n\n\nWhen Cruz was a freshman he was part of the US military-sponsored Junior Reserve Officers' Training Corp programme at the school.\n\nIn an interview with Reuters, Jillian Davis, 19, a recent graduate who was in the programme with Cruz, recalled his \"strange talking sometimes about knives and guns\", but said \"no one ever took him seriously\".\n\nChad Williams, 18, described Cruz as \"kind of an outcast\" who was \"crazy about guns\" and was known for unruly behavior at school, including a penchant for pulling false fire alarms.\n\n‌\n\n\n\n,'Everyone predicted it':, Chilling insight from pupil on school shooter\n\nTrevor Hart, who had been in a Spanish class with Cruz, told the Orlando Sentinel that the 19-year-old seemed \"a little off\" and had talked about shooting lizards, squirrels and frogs.\n\nFormer schoolmate Alex Azar told CBS Miami: \"He always seemed like the unstable type, the type who would do this sort of thing. He was always in the office. He was always in trouble, very unstable. He had that look to him, kind of sinister.\"\n\n‌\n\n\n\n‌\n\n\n\nFormer neighbour Shelby Speno told how police were called to Cruz's home numerous times and he had been seen shooting at a fellow neighbour's chickens.\n\nAnother former neighbour, Janine Kartiganer, added: “He wore a hoodie and always had his head down. He looked depressed.”\n\n‌\n\n\n\nWednesday's shooting ranked as the ninth-deadliest mass shooting in modern US history and the second-deadliest act of gun violence ever on a US public school campus, behind the massacre at Sandy Hook Elementary School, in Newtown, Connecticut, in December 2012.\n\nTributes are left after the mass shooting at Sandy Hook Elementary School in December 2012 (Image: Getty Images)\n\n‌\n\n\n\nIn that incident, deranged gunman Adam Lanza, 20, killed 20 children aged six and seven and six adult staff members after killing his mum Nancy at their home in the town.\n\n‌\n\n\n\nLanza shot and killed himself as emergency services arrived at the scene.\n\nThe number of school shootings in the US has steadily increased in recent years, and the Parkland shooting is just the latest chapter in the longtime debate over preventative measures, including gun control.\n\nThere were fresh calls for the US government to do more to prevent similar tragedies.\n\n‌\n\n\n\nUS President Donald Trump didn't mention any potential preventative measures in his response to the attack.\n\nHe appeared to suggest that those who were aware of the warning signs didn't do enough to alert authorities beforehand.\n\nHe wrote on Twitter: \"So many signs that the Florida shooter was mentally disturbed, even expelled from school for bad and erratic behavior. Neighbors and classmates knew he was a big problem. Must always report such instances to authorities, again and again!\"\n\n‌\n\n\n\nAn AR-15-style assault rifle (Image: Photodisc)\n\nIn earlier tweets, he wrote: \"My prayers and condolences to the families of the victims of the terrible Florida shooting. No child, teacher or anyone else should ever feel unsafe in an American school.\n\n\"Just spoke to Governor Rick Scott. We are working closely with law enforcement on the terrible Florida school shooting.\"\n\n‌\n\n\n\nReports from the US indicated that local police had dealt with Cruz on several occasions, he had been kicked out of school and staff were warned about him, and the FBI had investigated the \"professional school shooter\" comment that appeared to be posted by him on YouTube.\n\nAs well, CNN reported that Cruz was able to purchase an assault rifle after passing a background check.\n\nJoe Melita, former head of the Professional Standards & Special Investigative Unit at Broward County Public Schools, told Action News Jax that that several district security officials were aware of Cruz\n\n‌\n\n\n\nHe added: “They were familiar with who the young man was.”\n\nContent cannot be displayed without consent\n\n‌\n\n\n\nContent cannot be displayed without consent\n\n‌\n\n\n\nContent cannot be displayed without consent\n\n‌\n\n\n\nFormer Vice President Joe Biden tweeted: \"I am at a loss for what more to say. I grieve with the families in Parkland today. I grieve with the families across the country who have suffered loss due to gun violence. Congress has a moral obligation to take action and spare more families from this violence.\"\n\n‌\n\n\n\nMeanwhile there have been 18 school shootings in the US already this year, an average of one every 2.5 days. At this time last year there had been seven, US media reported.\n\nAccording to Gun Violence Archive, there have been 30 mass shootings since January 1, or one every 1.5 days.\n\nArticle continues below\n\nWednesday's school shooting occurred about 20 months after mass killer Omar Mateen, 29, murdered 49 people at a gay nightclub, called Pulse, in Orlando Florida. His rampage ended when he was shot dead by police.\n\nThe June 2016 massacre was the deadliest mass shooting in modern US history until gunman Stephen Paddock, 64, killed 58 people at a country music festival in Las Vegas last October.\n\nPaddock shot and killed himself before police stormed the Mandalay Bay hotel room he had used into a sniper's perch.", "images": ["http://www.mirror.co.uk/footer/ipso.svg", "https://i2-prod.mirror.co.uk/article12029289.ece/ALTERNATES/s615b/Shooting-at-Stoneman-Douglas-High-School-Parkland-USA-14-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article12029291.ece/ALTERNATES/s615b/Shooting-at-Stoneman-Douglas-High-School-Parkland-USA-14-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article12031014.ece/ALTERNATES/s615b/Jaime-Guttenberg.jpg", "http://www.mirror.co.uk/nav-web-static/release-v35-965ac09772b159ae18caae3528eb8aa68928366f/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article12029301.ece/ALTERNATES/s615b/school-shooting-suspect-02-wplg-jc-180214_4x3_992JPG.jpg", "https://i2-prod.mirror.co.uk/article12029346.ece/ALTERNATES/s615b/Images-of-Nikolas-Cruz-as-he-is-arrested-by-police-on-Josh-Cohen-twitter-page-the-image-was-given-to.jpg", "https://i2-prod.mirror.co.uk/article12029877.ece/ALTERNATES/s615b/Hero-teacher-hid-19-kids-in-closet-Melissa-Falkowski.jpg", "https://i2-prod.mirror.co.uk/article12029320.ece/ALTERNATES/s615b/Florida-shooting-Football-coach-battling-for-life-after-stepping-in-front-of-bullets-to-protect-ch.jpg", "https://i2-prod.mirror.co.uk/article12029572.ece/ALTERNATES/s615b/There-was-blood-everywhere-Students-tell-of-horror-inside-Florida-high-school-as-gunman-opened-fi.jpg", "https://i2-prod.mirror.co.uk/article12029288.ece/ALTERNATES/s615b/Shooting-at-Stoneman-Douglas-High-School-Parkland-USA-14-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article12029573.ece/ALTERNATES/s615b/There-was-blood-everywhere-Students-tell-of-horror-inside-Florida-high-school-as-gunman-opened-fi.jpg", "https://i2-prod.mirror.co.uk/article12029862.ece/ALTERNATES/s615b/Did-Florida-gunman-warn-of-shooting-9-months-earlier.jpg", "https://i2-prod.mirror.co.uk/article12029458.ece/ALTERNATES/s615b/Shooting-at-Stoneman-Douglas-High-School-Parkland-USA-14-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article12029617.ece/ALTERNATES/s615b/1518644672693JPG.jpg", "https://bcsecure01-a.akamaihd.net/24/4221396001/201802/1398/4221396001_5734300522001_5734303288001-vs.jpg?pubId=4221396001&videoId=5734303288001", "https://i2-prod.mirror.co.uk/article12029631.ece/ALTERNATES/s615b/PRIO-School-shooting.jpg", "https://i2-prod.mirror.co.uk/article12029319.ece/ALTERNATES/s615b/Florida-shooting-Football-coach-battling-for-life-after-stepping-in-front-of-bullets-to-protect-ch.jpg", "https://i2-prod.mirror.co.uk/article12031013.ece/ALTERNATES/s615b/Jaime-Guttenberg.jpg", "https://i2-prod.mirror.co.uk/article12029292.ece/ALTERNATES/s615b/Shooting-At-High-School-In-Parkland-Florida-Injures-Multiple-People.jpg", "https://i2-prod.mirror.co.uk/article12031012.ece/ALTERNATES/s615b/Jaime-Guttenberg.jpg", "http://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article12029789.ece/ALTERNATES/s615b/Shooting-at-Marjory-Stoneman-Douglas-High-School-Parkland-USA-14-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article12031196.ece/ALTERNATES/s615b/Shooting-at-Stoneman-Douglas-High-School-Parkland-USA-14-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article12031189.ece/ALTERNATES/s615b/Shooting-At-High-School-In-Parkland-Florida-Injures-Multiple-People.jpg", "https://i2-prod.mirror.co.uk/article12030665.ece/ALTERNATES/s810/DWEsyqIU8AA0MRd6932214904491222121.jpg", "https://i2-prod.mirror.co.uk/article12030665.ece/ALTERNATES/s615b/DWEsyqIU8AA0MRd6932214904491222121.jpg", "https://i2-prod.mirror.co.uk/article12029459.ece/ALTERNATES/s615b/High-School-Shooting-in-Parkland-Florida.jpg", "https://i2-prod.mirror.co.uk/article12030574.ece/ALTERNATES/s810/Aaron-Feis.jpg", "https://i2-prod.mirror.co.uk/article12029575.ece/ALTERNATES/s615b/There-was-blood-everywhere-Students-tell-of-horror-inside-Florida-high-school-as-gunman-opened-fi.jpg", "https://i2-prod.mirror.co.uk/article12031187.ece/ALTERNATES/s615b/Rescue-workers-prepare-to-transport-a-victim-on-a-stretcher-near-Marjory-Stoneman-Douglas-High-Schoo.jpg", "http://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg", "https://i2-prod.mirror.co.uk/article12033388.ece/ALTERNATES/s810/MAIN-Florida-Victims.jpg", "https://i2-prod.mirror.co.uk/article12029608.ece/ALTERNATES/s810/MAIN-Inside-the-mind-of-troubled-Nikolas-Cruz.jpg", "https://i2-prod.mirror.co.uk/article10145875.ece/ALTERNATES/s615b/Newtown-Commemorates-1-Week-Anniversary-Of-School-Massacre.jpg", "https://i2-prod.mirror.co.uk/article12029814.ece/ALTERNATES/s615b/School-shooting-in-Parkland-Florida-USA-14-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article12029296.ece/ALTERNATES/s615b/PRIO-School-shooting.jpg", "https://i2-prod.mirror.co.uk/article12029802.ece/ALTERNATES/s615b/AR15-assault-combat-rifle.jpg", "https://i2-prod.mirror.co.uk/article12031188.ece/ALTERNATES/s615b/Shooting-At-High-School-In-Parkland-Florida-Injures-Multiple-People.jpg", "https://i2-prod.mirror.co.uk/article12029788.ece/ALTERNATES/s615b/Shooting-at-Marjory-Stoneman-Douglas-High-School-Parkland-USA-14-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article12029574.ece/ALTERNATES/s615b/There-was-blood-everywhere-Students-tell-of-horror-inside-Florida-high-school-as-gunman-opened-fi.jpg", "https://i2-prod.mirror.co.uk/article12029815.ece/ALTERNATES/s615b/School-shooting-in-Parkland-Florida-USA-14-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article12028715.ece/ALTERNATES/s615b/Students-are-evacuated-from-Marjory-Stoneman-Douglas-High-School-during-a-shooting-incident-in-Parkl.jpg", "https://i2-prod.mirror.co.uk/article12029457.ece/ALTERNATES/s615b/School-shooting-in-Parkland-Florida-USA-14-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article12029787.ece/ALTERNATES/s615b/Shooting-at-Marjory-Stoneman-Douglas-High-School-Parkland-USA-14-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article12029796.ece/ALTERNATES/s615b/Fire-Rescue-vehicles-block-the-road-to-M.jpg", "https://i2-prod.mirror.co.uk/article12029292.ece/ALTERNATES/s1200/Shooting-At-High-School-In-Parkland-Florida-Injures-Multiple-People.jpg"], "top_img": "https://i2-prod.mirror.co.uk/article12029292.ece/ALTERNATES/s1200/Shooting-At-High-School-In-Parkland-Florida-Injures-Multiple-People.jpg", "keywords": [], "authors": ["Chris Kitching", "Lucy Clarke-Billings", "Steve Robson", "Newschris Kitching Senior News Reporter", "Lucy Clarke-Billings Deputy News Editor", "Steve", "Feb", "Chris Kitching Senior News Reporter", "Commentsnewschris Kitching Senior News Reporter", "Updated"], "canonical_link": "https://www.mirror.co.uk/news/us-news/there-blood-everywhere-terrified-students-12029466", "title": "Inside the Snapchat bloodbath: 60 minutes of terror which left 17 dead, bodies in classrooms and kids 'full of blood'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "WARNING - DISTRESSING CONTENT: Horrifying video captured during a mass shooting at Marjory Stoneman Douglas High School in Parkland, Florida, shows lifeless victims on the floor", "author": "Steve Robson", "robots": "noarchive, max-image-preview:large", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-12029466"}, "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Gun crime, shooting, Murder, Florida shootings, Parkland high school shooting", "news_keywords": "Gun crime, shooting, Murder, Florida shootings, Parkland high school shooting", "og": {"title": "Inside Snapchat school bloodbath - 60 minutes of terror which left 17 dead", "description": "WARNING - DISTRESSING CONTENT: Horrifying video captured during a mass shooting at Marjory Stoneman Douglas High School in Parkland, Florida, shows lifeless victims on the floor", "url": "https://www.mirror.co.uk/news/us-news/there-blood-everywhere-terrified-students-12029466", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article12029292.ece/ALTERNATES/s1200/Shooting-At-High-School-In-Parkland-Florida-Injures-Multiple-People.jpg", "type": "article"}, "article": {"published_time": "2018-02-15T08:12:59Z", "modified_time": "2018-02-15T22:09:20Z", "author": "https://www.facebook.com/dailymirror/", "section": "US News", "tag": "Parkland high school shooting"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@chriskitching, @LucyCB_1, @SteveRobson04", "title": "Inside the Snapchat bloodbath: 60 minutes of terror which left 17 dead, bodies in classrooms and kids 'full of blood' - The Mirror", "description": "WARNING - DISTRESSING CONTENT: Horrifying video captured during a mass shooting at Marjory Stoneman Douglas High School in Parkland, Florida, shows lifeless victims on the floor", "image": "https://i2-prod.mirror.co.uk/article12029292.ece/ALTERNATES/s1200/Shooting-At-High-School-In-Parkland-Florida-Injures-Multiple-People.jpg"}}, "movies": [], "publish_date": 1518682379.0, "source": "http://www.mirror.co.uk", "summary": ""}