{"url": "https://gellerreport.com/2018/07/facebook-declaration-independence-hate-speech.html/", "text": "It’s not surprising. The left hates our freedoms, and so designating the Declaration of Independence, the most magnificent document in all of human history, as hate speech is in line with their agenda. The left means to criminalize lawfulness. The left means to criminalize freedom of speech. The left means to criminalize individual rights. The left means to criminalize Americanism.\n\nIt starts with cultural assassination, delegitimization, dehumanization, then criminalization. Mark my words.\n\nFacebook labels declaration of independence as ‘hate speech’ The website told a local newspaper they violated its community guidelines by posting the original document Story continues below advertisement What must have seemed like a benign social media strategy managed to fall foul of Facebook’s algorithmic censors, which labeled sections of the declaration hate speech and removed the posts.\n\nThe Truth Must be Told Your contribution supports independent journalism Please take a moment to consider this. Now, more than ever, people are reading Geller Report for news they won't get anywhere else. But advertising revenues have all but disappeared. Google Adsense is the online advertising monopoly and they have banned us. Social media giants like Facebook and Twitter have blocked and shadow-banned our accounts. But we won't put up a paywall. Because never has the free world needed independent journalism more. Everyone who reads our reporting knows the Geller Report covers the news the media won't. We cannot do our ground-breaking report without your support. We must continue to report on the global jihad and the left's war on freedom. Our readers’ contributions make that possible. Geller Report's independent, investigative journalism takes a lot of time, money and hard work to produce. But we do it because we believe our work is critical in the fight for freedom and because it is your fight, too. Please contribute here. or Make a monthly commitment to support The Geller Report – choose the option that suits you best. $25.00 here\n\n$50.00 here\n\n$75.00 here\n\n$100.00 here\n\n$250.00 here", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://c.statcounter.com/12365610/0/9d63e1d3/0/", "http://b1ff5939f6.nxcli.net/wp-content/uploads/2018/07/foudning.jpg"], "top_img": "http://b1ff5939f6.nxcli.net/wp-content/uploads/2018/07/foudning.jpg", "keywords": [], "authors": ["Pamela Geller", "R. Arandas", "Carpe Diem", "Bill Kay", "Scott Smith", "Shirley Rosenhohn", "Harrie Mossel", "John Forbes", "Joy Daniels Brower", "Ken Kruger"], "canonical_link": "https://gellerreport.com/2018/07/facebook-declaration-independence-hate-speech.html/", "title": "Facebook removes, censors Declaration of Independence as ‘hate speech’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Facebook removes, censors Declaration of Independence as 'hate speech' - Geller Report", "description": "The left means to criminalize lawfulness. The left means to criminalize freedom of speech. The left means to criminalize individual rights. The left means to criminalize Americanism.", "url": "https://gellerreport.com/2018/07/facebook-declaration-independence-hate-speech.html/", "site_name": "Geller Report", "image": "http://b1ff5939f6.nxcli.net/wp-content/uploads/2018/07/foudning.jpg"}, "article": {"publisher": "https://www.facebook.com/pamelageller", "author": "https://www.facebook.com/pamelageller", "published_time": "2018-07-05T20:19:36+00:00", "modified_time": "2018-07-06T15:45:44+00:00"}, "twitter": {"card": "summary_large_image", "creator": "@pamelageller", "site": "@pamelageller"}, "generator": "WordPress 6.8.2", "msapplication-TileImage": "https://gellerreport.com/wp-content/uploads/2025/04/cropped-Screenshot-2025-04-07-at-7.18.20-AM-270x270.jpg"}, "movies": [], "publish_date": 1530821976.0, "source": "https://gellerreport.com", "summary": ""}